Catalogs/ДополнительныеАналитикиБухгалтерскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДополнительныеАналитикиБухгалтерскогоУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДополнительныеАналитикиБухгалтерскогоУчета/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
	
		ЗаполненоАналитик = 0;
		Если НЕ Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		Если НЕ СделкаРЕПО = Документы.СделкаРЕПО.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		Если НЕ ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка() Тогда
			ЗаполненоАналитик = ЗаполненоАналитик + 1;
		КонецЕсли;
		
		Наименование = "";
		Если НЕ Сделка = Документы.Сделка.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + "Сделка " + Лев(Сделка.Номер, 23);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + "Сд. " + Лев(Сделка.Номер, 11);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + "С. " + Лев(Сделка.Номер, 7);
			КонецЕсли;
		КонецЕсли;
		Если НЕ СделкаРЕПО = Документы.СделкаРЕПО.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + "Сделка РЕПО " + Лев(СделкаРЕПО.Номер, 18);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + " РЕПО " + Лев(СделкаРЕПО.Номер, 6);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + " № " + Лев(СделкаРЕПО.Номер, 7);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка() Тогда
			Если ЗаполненоАналитик = 1 Тогда
				Наименование = Наименование + Лев(ВидЗадолженности.Наименование, 30);
			ИначеЕсли ЗаполненоАналитик = 2 Тогда
				Наименование = Наименование + " " + Лев(ВидЗадолженности.Наименование, 14);
			ИначеЕсли ЗаполненоАналитик = 3 Тогда
				Наименование = Наименование + " " + Лев(ВидЗадолженности.Наименование, 9);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
